#include <iostream>
#include <cstdlib>
#include <list>
#include <conio.h>
using namespace std;
void fnct1(); 

int main()
{
	fnct1();  //Извиква функцията.
	return 0;
}

void fnct1()
{
	char c = 'a';  //Инициализира {char(c)} с произволна стойност, колкото да е инициализиран.
	list <char> list1;  //Създава списък с тип данни {char}.
	int i = 0;
do  
{
	i++;  //Използва се за брояч на итерации на цикълът.
    c = getchar();  //Използва се за да вземе символ от конзолата.
	list1.push_back(c);  //Избутва елементът в задната част на списъкът.
} while (c != '.');  //Докато (c) не е равно на ".", цикълът върви.
char* b = (char*)calloc(i, sizeof(char));  //Алокира памет спрямо броят на итерациите умножени по размерът на типа данни {char}.
for (int j = 0; j < i; j++)  //Вкарва елементите от списъка в обратен ред в масив [b].
{
	b[j] = list1.back();  //Слага последният елемент от списъка в масивът [b].
	list1.pop_back();  //Премахва последният елемент от списъка.
}
for (int z = 0; z < i; z++)
{
	cout << b[z];  //Извежда на екрана елемент по елемент, елемнтите от масив [b].
}
} 